MikroElektronika/core_packages/PIC/XC8/def/PIC16LF18854/mcu.h
extern volatile SMT2PRUbits_t SMT2PRUbits __at(0x517);
// bitfield macros
#define _SMT2PRU_PR_POSN                                    0x0
#define _SMT2PRU_PR_POSITION                                0x0
#define _SMT2PRU_PR_SIZE                                    0x8
#define _SMT2PRU_PR_LENGTH                                  0x8
#define _SMT2PRU_PR_MASK                                    0xFF
#define _SMT2PRU_PR16_POSN                                  0x0
#define _SMT2PRU_PR16_POSITION                              0x0
#define _SMT2PRU_PR16_SIZE                                  0x1
#define _SMT2PRU_PR16_LENGTH                                0x1
#define _SMT2PRU_PR16_MASK                                  0x1
#define _SMT2PRU_PR17_POSN                                  0x1
#define _SMT2PRU_PR17_POSITION                              0x1
#define _SMT2PRU_PR17_SIZE                                  0x1
#define _SMT2PRU_PR17_LENGTH                                0x1
#define _SMT2PRU_PR17_MASK                                  0x2
#define _SMT2PRU_PR18_POSN                                  0x2
#define _SMT2PRU_PR18_POSITION                              0x2
#define _SMT2PRU_PR18_SIZE                                  0x1
#define _SMT2PRU_PR18_LENGTH                                0x1
#define _SMT2PRU_PR18_MASK                                  0x4
#define _SMT2PRU_PR19_POSN                                  0x3
#define _SMT2PRU_PR19_POSITION                              0x3
#define _SMT2PRU_PR19_SIZE                                  0x1
#define _SMT2PRU_PR19_LENGTH                                0x1
#define _SMT2PRU_PR19_MASK                                  0x8
#define _SMT2PRU_PR20_POSN                                  0x4
#define _SMT2PRU_PR20_POSITION                              0x4
#define _SMT2PRU_PR20_SIZE                                  0x1
#define _SMT2PRU_PR20_LENGTH                                0x1
#define _SMT2PRU_PR20_MASK                                  0x10
#define _SMT2PRU_PR21_POSN                                  0x5
#define _SMT2PRU_PR21_POSITION                              0x5
#define _SMT2PRU_PR21_SIZE                                  0x1
#define _SMT2PRU_PR21_LENGTH                                0x1
#define _SMT2PRU_PR21_MASK                                  0x20
#define _SMT2PRU_PR22_POSN                                  0x6
#define _SMT2PRU_PR22_POSITION                              0x6
#define _SMT2PRU_PR22_SIZE                                  0x1
#define _SMT2PRU_PR22_LENGTH                                0x1
#define _SMT2PRU_PR22_MASK                                  0x40
#define _SMT2PRU_PR23_POSN                                  0x7
#define _SMT2PRU_PR23_POSITION                              0x7
#define _SMT2PRU_PR23_SIZE                                  0x1
#define _SMT2PRU_PR23_LENGTH                                0x1
#define _SMT2PRU_PR23_MASK                                  0x80
#define _SMT2PRU_SMT2PR_POSN                                0x0
#define _SMT2PRU_SMT2PR_POSITION                            0x0
#define _SMT2PRU_SMT2PR_SIZE                                0x8
#define _SMT2PRU_SMT2PR_LENGTH                              0x8
#define _SMT2PRU_SMT2PR_MASK                                0xFF
#define _SMT2PRU_SMT2PR16_POSN                              0x0
#define _SMT2PRU_SMT2PR16_POSITION                          0x0
#define _SMT2PRU_SMT2PR16_SIZE                              0x1
#define _SMT2PRU_SMT2PR16_LENGTH                            0x1
#define _SMT2PRU_SMT2PR16_MASK                              0x1
#define _SMT2PRU_SMT2PR17_POSN                              0x1
#define _SMT2PRU_SMT2PR17_POSITION                          0x1
#define _SMT2PRU_SMT2PR17_SIZE                              0x1
#define _SMT2PRU_SMT2PR17_LENGTH                            0x1
#define _SMT2PRU_SMT2PR17_MASK                              0x2
#define _SMT2PRU_SMT2PR18_POSN                              0x2
#define _SMT2PRU_SMT2PR18_POSITION                          0x2
#define _SMT2PRU_SMT2PR18_SIZE                              0x1
#define _SMT2PRU_SMT2PR18_LENGTH                            0x1
#define _SMT2PRU_SMT2PR18_MASK                              0x4
#define _SMT2PRU_SMT2PR19_POSN                              0x3
#define _SMT2PRU_SMT2PR19_POSITION                          0x3
#define _SMT2PRU_SMT2PR19_SIZE                              0x1
#define _SMT2PRU_SMT2PR19_LENGTH                            0x1
#define _SMT2PRU_SMT2PR19_MASK                              0x8
#define _SMT2PRU_SMT2PR20_POSN                              0x4
#define _SMT2PRU_SMT2PR20_POSITION                          0x4
#define _SMT2PRU_SMT2PR20_SIZE                              0x1
#define _SMT2PRU_SMT2PR20_LENGTH                            0x1
#define _SMT2PRU_SMT2PR20_MASK                              0x10
#define _SMT2PRU_SMT2PR21_POSN                              0x5
#define _SMT2PRU_SMT2PR21_POSITION                          0x5
#define _SMT2PRU_SMT2PR21_SIZE                              0x1
#define _SMT2PRU_SMT2PR21_LENGTH                            0x1
#define _SMT2PRU_SMT2PR21_MASK                              0x20
#define _SMT2PRU_SMT2PR22_POSN                              0x6
#define _SMT2PRU_SMT2PR22_POSITION                          0x6
#define _SMT2PRU_SMT2PR22_SIZE                              0x1
#define _SMT2PRU_SMT2PR22_LENGTH                            0x1
#define _SMT2PRU_SMT2PR22_MASK                              0x40
#define _SMT2PRU_SMT2PR23_POSN                              0x7
#define _SMT2PRU_SMT2PR23_POSITION                          0x7
#define _SMT2PRU_SMT2PR23_SIZE                              0x1
#define _SMT2PRU_SMT2PR23_LENGTH                            0x1
#define _SMT2PRU_SMT2PR23_MASK                              0x80

// Register: SMT2CON0
#define SMT2CON0 SMT2CON0
extern volatile unsigned char           SMT2CON0            __at(0x518);
#ifndef _LIB_BUILD
asm("SMT2CON0 equ 0518h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PS                     :2;
        unsigned CPOL                   :1;
        unsigned SPOL                   :1;
        unsigned WPOL                   :1;
        unsigned STP                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned SMT2PS                 :2;
        unsigned SMT2CPOL               :1;
        unsigned SMT2SPOL               :1;
        unsigned SMT2WOL                :1;
        unsigned SMT2STP                :1;
        unsigned                        :1;
        unsigned SMT2EN                 :1;
    };
    struct {
        unsigned _PS0                    :1;  // Note: Changed by MikroE
        unsigned _PS1                    :1;  // Note: Changed by MikroE
    };
    struct {
        unsigned SMT2PS0                :1;
        unsigned SMT2PS1                :1;
    };
} SMT2CON0bits_t;
extern volatile SMT2CON0bits_t SMT2CON0bits __at(0x518);
// bitfield macros
#define _SMT2CON0_PS_POSN                                   0x0
#define _SMT2CON0_PS_POSITION                               0x0
#define _SMT2CON0_PS_SIZE                                   0x2
#define _SMT2CON0_PS_LENGTH                                 0x2
#define _SMT2CON0_PS_MASK                                   0x3
#define _SMT2CON0_CPOL_POSN                                 0x2
#define _SMT2CON0_CPOL_POSITION                             0x2
#define _SMT2CON0_CPOL_SIZE                                 0x1
#define _SMT2CON0_CPOL_LENGTH                               0x1
#define _SMT2CON0_CPOL_MASK                                 0x4
#define _SMT2CON0_SPOL_POSN                                 0x3
#define _SMT2CON0_SPOL_POSITION                             0x3
#define _SMT2CON0_SPOL_SIZE                                 0x1
#define _SMT2CON0_SPOL_LENGTH                               0x1
#define _SMT2CON0_SPOL_MASK                                 0x8
#define _SMT2CON0_WPOL_POSN                                 0x4
#define _SMT2CON0_WPOL_POSITION                             0x4
#define _SMT2CON0_WPOL_SIZE                                 0x1
#define _SMT2CON0_WPOL_LENGTH                               0x1
#define _SMT2CON0_WPOL_MASK                                 0x10
#define _SMT2CON0_STP_POSN                                  0x5
#define _SMT2CON0_STP_POSITION                              0x5
#define _SMT2CON0_STP_SIZE                                  0x1
#define _SMT2CON0_STP_LENGTH                                0x1
#define _SMT2CON0_STP_MASK                                  0x20
#define _SMT2CON0_EN_POSN                                   0x7
#define _SMT2CON0_EN_POSITION                               0x7
#define _SMT2CON0_EN_SIZE                                   0x1
#define _SMT2CON0_EN_LENGTH                                 0x1
#define _SMT2CON0_EN_MASK                                   0x80
#define _SMT2CON0_SMT2PS_POSN                               0x0
#define _SMT2CON0_SMT2PS_POSITION                           0x0
#define _SMT2CON0_SMT2PS_SIZE                               0x2
#define _SMT2CON0_SMT2PS_LENGTH                             0x2
#define _SMT2CON0_SMT2PS_MASK                               0x3
#define _SMT2CON0_SMT2CPOL_POSN                             0x2
#define _SMT2CON0_SMT2CPOL_POSITION                         0x2
#define _SMT2CON0_SMT2CPOL_SIZE                             0x1
#define _SMT2CON0_SMT2CPOL_LENGTH                           0x1
#define _SMT2CON0_SMT2CPOL_MASK                             0x4
#define _SMT2CON0_SMT2SPOL_POSN                             0x3
#define _SMT2CON0_SMT2SPOL_POSITION                         0x3
#define _SMT2CON0_SMT2SPOL_SIZE                             0x1
#define _SMT2CON0_SMT2SPOL_LENGTH                           0x1
#define _SMT2CON0_SMT2SPOL_MASK                             0x8
#define _SMT2CON0_SMT2WOL_POSN                              0x4
#define _SMT2CON0_SMT2WOL_POSITION                          0x4
#define _SMT2CON0_SMT2WOL_SIZE                              0x1
#define _SMT2CON0_SMT2WOL_LENGTH                            0x1
#define _SMT2CON0_SMT2WOL_MASK                              0x10
#define _SMT2CON0_SMT2STP_POSN                              0x5
#define _SMT2CON0_SMT2STP_POSITION                          0x5
#define _SMT2CON0_SMT2STP_SIZE                              0x1
#define _SMT2CON0_SMT2STP_LENGTH                            0x1
#define _SMT2CON0_SMT2STP_MASK                              0x20
#define _SMT2CON0_SMT2EN_POSN                               0x7
#define _SMT2CON0_SMT2EN_POSITION                           0x7
#define _SMT2CON0_SMT2EN_SIZE                               0x1
#define _SMT2CON0_SMT2EN_LENGTH                             0x1
#define _SMT2CON0_SMT2EN_MASK                               0x80
#define _SMT2CON0_PS0_POSN                                  0x0
#define _SMT2CON0_PS0_POSITION                              0x0
#define _SMT2CON0_PS0_SIZE                                  0x1
#define _SMT2CON0_PS0_LENGTH                                0x1
#define _SMT2CON0_PS0_MASK                                  0x1
#define _SMT2CON0_PS1_POSN                                  0x1
#define _SMT2CON0_PS1_POSITION                              0x1
#define _SMT2CON0_PS1_SIZE                                  0x1
#define _SMT2CON0_PS1_LENGTH                                0x1
#define _SMT2CON0_PS1_MASK                                  0x2
#define _SMT2CON0_SMT2PS0_POSN                              0x0
#define _SMT2CON0_SMT2PS0_POSITION                          0x0
#define _SMT2CON0_SMT2PS0_SIZE                              0x1
#define _SMT2CON0_SMT2PS0_LENGTH                            0x1
#define _SMT2CON0_SMT2PS0_MASK                              0x1
#define _SMT2CON0_SMT2PS1_POSN                              0x1
#define _SMT2CON0_SMT2PS1_POSITION                          0x1
#define _SMT2CON0_SMT2PS1_SIZE                              0x1
#define _SMT2CON0_SMT2PS1_LENGTH                            0x1
#define _SMT2CON0_SMT2PS1_MASK                              0x2

