MikroElektronika/core_packages/PIC/XC8/def/PIC16LF18854/mcu.h
extern volatile PIR8bits_t PIR8bits __at(0x714);
// bitfield macros
#define _PIR8_SMT1IF_POSN                                   0x0
#define _PIR8_SMT1IF_POSITION                               0x0
#define _PIR8_SMT1IF_SIZE                                   0x1
#define _PIR8_SMT1IF_LENGTH                                 0x1
#define _PIR8_SMT1IF_MASK                                   0x1
#define _PIR8_SMT1PRAIF_POSN                                0x1
#define _PIR8_SMT1PRAIF_POSITION                            0x1
#define _PIR8_SMT1PRAIF_SIZE                                0x1
#define _PIR8_SMT1PRAIF_LENGTH                              0x1
#define _PIR8_SMT1PRAIF_MASK                                0x2
#define _PIR8_SMT1PWAIF_POSN                                0x2
#define _PIR8_SMT1PWAIF_POSITION                            0x2
#define _PIR8_SMT1PWAIF_SIZE                                0x1
#define _PIR8_SMT1PWAIF_LENGTH                              0x1
#define _PIR8_SMT1PWAIF_MASK                                0x4
#define _PIR8_SMT2IF_POSN                                   0x3
#define _PIR8_SMT2IF_POSITION                               0x3
#define _PIR8_SMT2IF_SIZE                                   0x1
#define _PIR8_SMT2IF_LENGTH                                 0x1
#define _PIR8_SMT2IF_MASK                                   0x8
#define _PIR8_SMT2PRAIF_POSN                                0x4
#define _PIR8_SMT2PRAIF_POSITION                            0x4
#define _PIR8_SMT2PRAIF_SIZE                                0x1
#define _PIR8_SMT2PRAIF_LENGTH                              0x1
#define _PIR8_SMT2PRAIF_MASK                                0x10
#define _PIR8_SMT2PWAIF_POSN                                0x5
#define _PIR8_SMT2PWAIF_POSITION                            0x5
#define _PIR8_SMT2PWAIF_SIZE                                0x1
#define _PIR8_SMT2PWAIF_LENGTH                              0x1
#define _PIR8_SMT2PWAIF_MASK                                0x20

// Register: PIE0
#define PIE0 PIE0
extern volatile unsigned char           PIE0                __at(0x716);
#ifndef _LIB_BUILD
asm("PIE0 equ 0716h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTE                   :1;
        unsigned                        :3;
        unsigned IOCIE                  :1;
        unsigned TMR0IE                 :1;
    };
} PIE0bits_t;
extern volatile PIE0bits_t PIE0bits __at(0x716);
// bitfield macros
#define _PIE0_INTE_POSN                                     0x0
#define _PIE0_INTE_POSITION                                 0x0
#define _PIE0_INTE_SIZE                                     0x1
#define _PIE0_INTE_LENGTH                                   0x1
#define _PIE0_INTE_MASK                                     0x1
#define _PIE0_IOCIE_POSN                                    0x4
#define _PIE0_IOCIE_POSITION                                0x4
#define _PIE0_IOCIE_SIZE                                    0x1
#define _PIE0_IOCIE_LENGTH                                  0x1
#define _PIE0_IOCIE_MASK                                    0x10
#define _PIE0_TMR0IE_POSN                                   0x5
#define _PIE0_TMR0IE_POSITION                               0x5
#define _PIE0_TMR0IE_SIZE                                   0x1
#define _PIE0_TMR0IE_LENGTH                                 0x1
#define _PIE0_TMR0IE_MASK                                   0x20

// Register: PIE1
#define PIE1 PIE1
extern volatile unsigned char           PIE1                __at(0x717);
#ifndef _LIB_BUILD
asm("PIE1 equ 0717h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADIE                   :1;
        unsigned ADTIE                  :1;
        unsigned                        :4;
        unsigned CSWIE                  :1;
        unsigned OSFIE                  :1;
    };
} PIE1bits_t;
extern volatile PIE1bits_t PIE1bits __at(0x717);
// bitfield macros
#define _PIE1_ADIE_POSN                                     0x0
#define _PIE1_ADIE_POSITION                                 0x0
#define _PIE1_ADIE_SIZE                                     0x1
#define _PIE1_ADIE_LENGTH                                   0x1
#define _PIE1_ADIE_MASK                                     0x1
#define _PIE1_ADTIE_POSN                                    0x1
#define _PIE1_ADTIE_POSITION                                0x1
#define _PIE1_ADTIE_SIZE                                    0x1
#define _PIE1_ADTIE_LENGTH                                  0x1
#define _PIE1_ADTIE_MASK                                    0x2
#define _PIE1_CSWIE_POSN                                    0x6
#define _PIE1_CSWIE_POSITION                                0x6
#define _PIE1_CSWIE_SIZE                                    0x1
#define _PIE1_CSWIE_LENGTH                                  0x1
#define _PIE1_CSWIE_MASK                                    0x40
#define _PIE1_OSFIE_POSN                                    0x7
#define _PIE1_OSFIE_POSITION                                0x7
#define _PIE1_OSFIE_SIZE                                    0x1
#define _PIE1_OSFIE_LENGTH                                  0x1
#define _PIE1_OSFIE_MASK                                    0x80

// Register: PIE2
#define PIE2 PIE2
extern volatile unsigned char           PIE2                __at(0x718);
#ifndef _LIB_BUILD
asm("PIE2 equ 0718h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C1IE                   :1;
        unsigned C2IE                   :1;
        unsigned                        :4;
        unsigned ZCDIE                  :1;
    };
} PIE2bits_t;
extern volatile PIE2bits_t PIE2bits __at(0x718);
// bitfield macros
#define _PIE2_C1IE_POSN                                     0x0
#define _PIE2_C1IE_POSITION                                 0x0
#define _PIE2_C1IE_SIZE                                     0x1
#define _PIE2_C1IE_LENGTH                                   0x1
#define _PIE2_C1IE_MASK                                     0x1
#define _PIE2_C2IE_POSN                                     0x1
#define _PIE2_C2IE_POSITION                                 0x1
#define _PIE2_C2IE_SIZE                                     0x1
#define _PIE2_C2IE_LENGTH                                   0x1
#define _PIE2_C2IE_MASK                                     0x2
#define _PIE2_ZCDIE_POSN                                    0x6
#define _PIE2_ZCDIE_POSITION                                0x6
#define _PIE2_ZCDIE_SIZE                                    0x1
#define _PIE2_ZCDIE_LENGTH                                  0x1
#define _PIE2_ZCDIE_MASK                                    0x40

// Register: PIE3
#define PIE3 PIE3
extern volatile unsigned char           PIE3                __at(0x719);
#ifndef _LIB_BUILD
asm("PIE3 equ 0719h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP1IE                 :1;
        unsigned BCL1IE                 :1;
        unsigned SSP2IE                 :1;
        unsigned BCL2IE                 :1;
        unsigned TXIE                   :1;
        unsigned RCIE                   :1;
    };
} PIE3bits_t;
